
## Terraform plan for environment: `prep`

**Commit:** 6cf20b8dfc1ebc9cc7385c0f4c2a694f5319a8ae


**API version:** 802463b33a
**CLI version:** 802463b33a
**Selfserve version:** 802463b33a
**Internal version:** 802463b33a

### Plan summary

`4 to add, 88 to change, 4 to destroy`

**🆕 Creates**

```tf
module.service.aws_lb_listener_rule.internal-pub[0]
module.service.module.ecs_service["api"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_task_definition.this[0]
```
**🗑️ Deletes**

```tf
null_resource.deployed_versions
module.service.aws_cloudwatch_log_group.this["search"]
module.service.module.batch.aws_batch_job_definition.this["search"]
module.service.module.cloudwatch_log-metric-filter["search"].aws_cloudwatch_log_metric_filter.this[0]
```
**📖 Reads**

```tf
module.service.module.ecs_service["api"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].data.aws_ecs_task_definition.this[0]
module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0]
```
**🔄 Updates**

```tf
module.service.aws_cloudwatch_dashboard.this
module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"]
module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"]
module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"]
module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"]
module.service.module.batch.aws_batch_job_definition.this["cns"]
module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"]
module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"]
module.service.module.batch.aws_batch_job_definition.this["database-maintenance"]
module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"]
module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"]
module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"]
module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"]
module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"]
module.service.module.batch.aws_batch_job_definition.this["import-anondb"]
module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"]
module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"]
module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"]
module.service.module.batch.aws_batch_job_definition.this["international-goods-export"]
module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"]
module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"]
module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"]
module.service.module.batch.aws_batch_job_definition.this["ni-compliance"]
module.service.module.batch.aws_batch_job_definition.this["populate-anondb"]
module.service.module.batch.aws_batch_job_definition.this["process-cl"]
module.service.module.batch.aws_batch_job_definition.this["process-company-profile"]
module.service.module.batch.aws_batch_job_definition.this["process-inbox"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"]
module.service.module.batch.aws_batch_job_definition.this["process-ntu"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-community-licences"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-ecmt-accept"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-general"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-irhp-allocate"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-print"]
module.service.module.batch.aws_batch_job_definition.this["psv-operator-list-export"]
module.service.module.batch.aws_batch_job_definition.this["remove-read-audit"]
module.service.module.batch.aws_batch_job_definition.this["resolve-payments"]
module.service.module.batch.aws_batch_job_definition.this["sas-mi-extract"]
module.service.module.batch.aws_batch_job_definition.this["system-parameter"]
module.service.module.batch.aws_batch_job_definition.this["transxchange-consumer"]
module.service.module.cloudfront.aws_cloudfront_distribution.this[0]
module.service.module.ecs_service["api"].aws_ecs_service.this[0]
module.service.module.ecs_service["internal"].aws_ecs_service.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_service.this[0]
module.service.module.eventbridge.aws_iam_policy.additional_inline[0]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-clean-up-variations"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-close-expired-windows"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-cns"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-company-profile-dlq"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-create-psv-licence-surrender-task"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-digital-continuation-reminders"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-duplicate-vehicle-warning"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-enqueue-ch-compare"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-expire-bus-registration"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-flag-urgent-tasks"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-inspection-request-email"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-interim-end-date-enforcement"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-international-goods-export"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-last-tm-letter"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-licence-status-rules"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-mark-expired-permits"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-company-profile"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-inbox"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-insolvency"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-insolvency-dlq"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-ntu"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-community-licences"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-disc-generation"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-disc-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-ecmt-accept"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-general"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-irhp-allocate"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-permit-generation"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-permit-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-psv-operator-list-export"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-remove-read-audit"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-resolve-payments"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-transxchange-consumer"]
```


----

<details data-gh-workflow="prep-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # null_resource.deployed_versions must be replaced
-/+ resource "null_resource" "deployed_versions" {
      ~ id       = "3209133683423274331" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "deployed_api_image_tag"       = "release-v6.1.6-rc1-rc1" -> "802463b33a"
          ~ "deployed_assets_version"      = "release-v6.1.6-rc1-rc1" -> "release-v6.0.2"
          ~ "deployed_cli_image_tag"       = "release-v6.1.6-rc1-rc1" -> "802463b33a"
          ~ "deployed_internal_image_tag"  = "release-v6.1.6-rc1-rc1" -> "802463b33a"
          ~ "deployed_selfserve_image_tag" = "release-v6.1.6-rc1-rc1" -> "802463b33a"
        }
    }

  # module.service.aws_cloudwatch_dashboard.this will be updated in-place
  ~ resource "aws_cloudwatch_dashboard" "this" {
      ~ dashboard_body = jsonencode(
          ~ {
              ~ widgets = [
                    # (1 unchanged element hidden)
                    {
                        height     = 6
                        properties = {
                            query   = <<-EOT
                                SOURCE '/aws/events/vol-app-prep-failures' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                            region  = "eu-west-1"
                            stacked = false
                            title   = "Batch failure logs"
                            view    = "table"
                        }
                        type       = "log"
                        width      = 18
                        x          = 12
                        y          = 6
                    },
                  ~ {
                      ~ properties = {
                          ~ metrics = [
                                # (44 unchanged elements hidden)
                                [
                                    "AWS/Logs",
                                    "IncomingLogEvents",
                                    "LogGroupName",
                                    "/aws/batch/vol-app-prep-liquibase",
                                ],
                              - [
                                  - "AWS/Logs",
                                  - "IncomingLogEvents",
                                  - "LogGroupName",
                                  - "/aws/batch/vol-app-prep-search",
                                ],
                                [
                                    "AWS/Logs",
                                    "IncomingLogEvents",
                                    "LogGroupName",
                                    "/aws/batch/vol-app-prep-sas-mi-extract",
                                ],
                                # (3 unchanged elements hidden)
                            ]
                            # (4 unchanged attributes hidden)
                        }
                        # (5 unchanged attributes hidden)
                    },
                    {
                        height     = 1
                        properties = {
                            query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-prep-ch-vs-olcs-diffs' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                            region  = "eu-west-1"
                            stacked = false
                            title   = "ch-vs-olcs-diffs-logs"
                            view    = "table"
                        }
                        type       = "log"
                        width      = 6
                        x          = 0
                        y          = 0
                    },
                    # (43 unchanged elements hidden)
                    {
                        height     = 1
                        properties = {
                            query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-prep-liquibase' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                            region  = "eu-west-1"
                            stacked = false
                            title   = "liquibase-logs"
                            view    = "table"
                        }
                        type       = "log"
                        width      = 6
                        x          = 0
                        y          = 0
                    },
                  - {
                      - height     = 1
                      - properties = {
                          - query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-prep-search' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                          - region  = "eu-west-1"
                          - stacked = false
                          - title   = "search-logs"
                          - view    = "table"
                        }
                      - type       = "log"
                      - width      = 6
                      - x          = 0
                      - y          = 0
                    },
                    {
                        height     = 1
                        properties = {
                            query   = <<-EOT
                                SOURCE '/aws/batch/vol-app-prep-sas-mi-extract' | fields @timestamp, @message, @logStream, @log
                                | sort @timestamp desc
                                | limit 10000
                            EOT
                            region  = "eu-west-1"
                            stacked = false
                            title   = "sas-mi-extract-logs"
                            view    = "table"
                        }
                        type       = "log"
                        width      = 6
                        x          = 0
                        y          = 0
                    },
                    # (3 unchanged elements hidden)
                ]
            }
        )
        id             = "batch-vol-app-prep"
        # (2 unchanged attributes hidden)
    }

  # module.service.aws_cloudwatch_log_group.this["search"] will be destroyed
  # (because key ["search"] is not in for_each map)
  - resource "aws_cloudwatch_log_group" "this" {
      - arn               = "arn:aws:logs:eu-west-1:146997448015:log-group:/aws/batch/vol-app-prep-search" -> null
      - id                = "/aws/batch/vol-app-prep-search" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/batch/vol-app-prep-search" -> null
      - retention_in_days = 1 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {
          - "Environment" = "prep"
          - "Repository"  = "https://github.com/dvsa/vol-app"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.service.aws_lb_listener_rule.internal-pub[0] will be created
  + resource "aws_lb_listener_rule" "internal-pub" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:eu-west-1:146997448015:listener/app/APPPP-OLCS-PUB-IUWEB-ALB/1767da8fedb18d14/582e73c0e8b187cc"
      + priority     = 16
      + tags_all     = {
          + "Environment" = "prep"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:146997448015:targetgroup/vol-app-iuweb-prep-pub-tg/c20ce101fb860342"
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "iuweb.*",
                ]
            }
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cancel-unsubmitted-bilateral:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "802463b33a"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cancel-unsubmitted-bilateral:57"
        name                       = "vol-app-prep-cancel-unsubmitted-bilateral"
      ~ revision                   = 57 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ch-vs-olcs-diffs:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "802463b33a"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ch-vs-olcs-diffs:57"
        name                       = "vol-app-prep-ch-vs-olcs-diffs"
      ~ revision                   = 57 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-clean-up-variations:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "802463b33a"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-clean-up-variations:57"
        name                       = "vol-app-prep-clean-up-variations"
      ~ revision                   = 57 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-close-expired-windows:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "802463b33a"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-close-expired-windows:57"
        name                       = "vol-app-prep-close-expired-windows"
      ~ revision                   = 57 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["cns"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cns:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "802463b33a"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cns:57"
        name                       = "vol-app-prep-cns"
      ~ revision                   = 57 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-company-profile-dlq:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "802463b33a"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-company-profile-dlq:57"
        name                       = "vol-app-prep-company-profile-dlq"
      ~ revision                   = 57 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-create-psv-licence-surrender-task:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "802463b33a"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-create-psv-licence-surrender-task:57"
        name                       = "vol-app-prep-create-psv-licence-surrender-task"
      ~ revision                   = 57 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-delete:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "802463b33a"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-delete:57"
        name                       = "vol-app-prep-data-retention-delete"
      ~ revision                   = 57 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-populate:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "802463b33a"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-populate:57"
        name                       = "vol-app-prep-data-retention-populate"
      ~ revision                   = 57 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-postcheck:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "802463b33a"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-postcheck:57"
        name                       = "vol-app-prep-data-retention-postcheck"
      ~ revision                   = 57 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-precheck:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "802463b33a"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-precheck:57"
        name                       = "vol-app-prep-data-retention-precheck"
      ~ revision                   = 57 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["database-maintenance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-database-maintenance:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "802463b33a"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-database-maintenance:57"
        name                       = "vol-app-prep-database-maintenance"
      ~ revision                   = 57 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-digital-continuation-reminders:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "802463b33a"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-digital-continuation-reminders:57"
        name                       = "vol-app-prep-digital-continuation-reminders"
      ~ revision                   = 57 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-duplicate-vehicle-warning:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "802463b33a"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-duplicate-vehicle-warning:57"
        name                       = "vol-app-prep-duplicate-vehicle-warning"
      ~ revision                   = 57 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-enqueue-ch-compare:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "802463b33a"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-enqueue-ch-compare:57"
        name                       = "vol-app-prep-enqueue-ch-compare"
      ~ revision                   = 57 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-expire-bus-registration:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "802463b33a"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-expire-bus-registration:57"
        name                       = "vol-app-prep-expire-bus-registration"
      ~ revision                   = 57 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-flag-urgent-tasks:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "802463b33a"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-flag-urgent-tasks:57"
        name                       = "vol-app-prep-flag-urgent-tasks"
      ~ revision                   = 57 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["import-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-anondb:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.1.6-rc1-rc1"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prep.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.pre.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prep.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "802463b33a"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prep.olcs.dvsacloud.uk"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-anondb:63"
        name                       = "vol-app-prep-import-anondb"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-users-from-csv:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "802463b33a"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-users-from-csv:57"
        name                       = "vol-app-prep-import-users-from-csv"
      ~ revision                   = 57 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-inspection-request-email:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "802463b33a"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-inspection-request-email:57"
        name                       = "vol-app-prep-inspection-request-email"
      ~ revision                   = 57 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-interim-end-date-enforcement:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "802463b33a"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-interim-end-date-enforcement:57"
        name                       = "vol-app-prep-interim-end-date-enforcement"
      ~ revision                   = 57 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["international-goods-export"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-international-goods-export:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "802463b33a"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-international-goods-export:57"
        name                       = "vol-app-prep-international-goods-export"
      ~ revision                   = 57 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-last-tm-letter:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "802463b33a"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-last-tm-letter:57"
        name                       = "vol-app-prep-last-tm-letter"
      ~ revision                   = 57 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-licence-status-rules:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "802463b33a"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-licence-status-rules:57"
        name                       = "vol-app-prep-licence-status-rules"
      ~ revision                   = 57 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-mark-expired-permits:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "802463b33a"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-mark-expired-permits:57"
        name                       = "vol-app-prep-mark-expired-permits"
      ~ revision                   = 57 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ni-compliance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ni-compliance:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.1.6-rc1-rc1"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prep.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.pre.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prep.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "802463b33a"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prep.olcs.dvsacloud.uk"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ni-compliance:63"
        name                       = "vol-app-prep-ni-compliance"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["populate-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-populate-anondb:63" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.1.6-rc1-rc1"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prep.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.pre.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prep.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "802463b33a"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prep.olcs.dvsacloud.uk"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-populate-anondb:63"
        name                       = "vol-app-prep-populate-anondb"
      ~ revision                   = 63 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-cl"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-cl:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "802463b33a"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-cl:57"
        name                       = "vol-app-prep-process-cl"
      ~ revision                   = 57 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-company-profile"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-company-profile:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "802463b33a"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-company-profile:57"
        name                       = "vol-app-prep-process-company-profile"
      ~ revision                   = 57 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-inbox"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-inbox:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "802463b33a"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.6-rc1-rc1" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:802463b33a"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-inbox:57"
        name                       = "vol-app-prep-process-inbox"
      ~ revision                   = 57 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-insolvency"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-insolvency:57" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.6-rc1-rc1" -> "PP"
      ... (truncated, see full plan in the workflow run logs)
```

</details>